{
  "Sad": [
    {
      "translation": "Our Lord, do not impose blame upon us if we have forgotten or erred. (Qur'an 2:286)"
    },
    {
      "translation": "Indeed, with hardship comes ease. (Qur'an 94:6)"
    },
    {
      "translation": "O Turner of hearts, keep my heart firm upon Your religion. (Hadith)"
    },
    {
      "translation": "Sufficient for me is Allah; there is no deity except Him. On Him I rely. (Qur'an 9:129)"
    },
    {
      "translation": "O Allah, remove the hardship, O Lord of mankind, and heal me, for You are the Healer. (Hadith)"
    }
  ],
  "Grateful": [
    {
      "translation": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents. (Qur'an 27:19)"
    },
    {
      "translation": "All praise is for Allah who gave us life after causing us to die, and to Him is the resurrection. (Hadith)"
    },
    {
      "translation": "If you are grateful, I will surely increase you. (Qur'an 14:7)"
    },
    {
      "translation": "All praise is for Allah in every circumstance. (Hadith)"
    },
    {
      "translation": "My Lord, inspire me to be grateful for Your favors and to do righteous deeds. (Qur'an 46:15)"
    }
  ],
  "Forgiveness": [
    {
      "translation": "My Lord, forgive and have mercy, for You are the best of the merciful. (Qur'an 23:118)"
    },
    {
      "translation": "Our Lord, forgive us our sins and remove from us our misdeeds. (Qur'an 3:193)"
    },
    {
      "translation": "O Allah, You are Most Forgiving, and You love forgiveness, so forgive me. (Hadith)"
    },
    {
      "translation": "And forgive us our sins, and grant us protection from our wrongdoings. (Qur'an 3:16)"
    },
    {
      "translation": "O my Lord, forgive me and my parents, and whoever enters my house as a believer. (Qur'an 71:28)"
    }
  ],
  "Angry": [
    {
      "translation": "I seek refuge with Allah from Satan, the accursed. (Hadith)"
    },
    {
      "translation": "O Allah, forgive me, have mercy upon me, guide me, and grant me well-being. (Hadith)"
    },
    {
      "translation": "Those who restrain anger and pardon the people – and Allah loves the doers of good. (Qur'an 3:134)"
    },
    {
      "translation": "And if an evil suggestion comes to you from Satan, then seek refuge in Allah. (Qur'an 7:200)"
    },
    {
      "translation": "O Allah, fill my heart with peace and patience, and remove from me anger and resentment. (Inspired by Hadith)"
    }
  ]
}
