{
  "Sad": [
    {
      "translation": "Our Lord, do not impose blame upon us if we have forgotten or erred. (Qur'an 2:286)"
    },
    {
      "translation": "Indeed, with hardship comes ease. (Qur'an 94:6)"
    },
    {
      "translation": "O Turner of hearts, keep my heart firm upon Your religion. (Hadith)"
    },
    {
      "translation": "Sufficient for me is Allah; there is no deity except Him. On Him I rely. (Qur'an 9:129)"
    },
    {
      "translation": "O Allah, remove the hardship, O Lord of mankind, and heal me, for You are the Healer. (Hadith)"
    },
    {
      "translation": "Our Lord, pour upon us patience and let us die as Muslims [in submission to You]. (Qur'an 7:126)"
    },
    {
      "translation": "Do not grieve; indeed Allah is with us. (Qur'an 9:40)"
    },
    {
      "translation": "O Allah, make the Qur’an the spring of my heart, the light of my chest, the remover of my sadness, and the repeller of my anxiety. (Hadith)"
    },
    {
      "translation": "And We will surely test you with something of fear and hunger, but give good tidings to the patient. (Qur'an 2:155)"
    },
    {
      "translation": "And He will remove their sorrow, and reward them for what they patiently endured. (Qur'an 76:12)"
    }
  ],
  "Grateful": [
    {
      "translation": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents. (Qur'an 27:19)"
    },
    {
      "translation": "All praise is for Allah who gave us life after causing us to die, and to Him is the resurrection. (Hadith)"
    },
    {
      "translation": "If you are grateful, I will surely increase you. (Qur'an 14:7)"
    },
    {
      "translation": "All praise is for Allah in every circumstance. (Hadith)"
    },
    {
      "translation": "My Lord, inspire me to be grateful for Your favors and to do righteous deeds. (Qur'an 46:15)"
    },
    {
      "translation": "So remember Me; I will remember you. And be grateful to Me and do not deny Me. (Qur'an 2:152)"
    },
    {
      "translation": "And whatever you have of favor – it is from Allah. (Qur'an 16:53)"
    },
    {
      "translation": "O Allah, help me remember You, thank You, and worship You in the best manner. (Hadith)"
    },
    {
      "translation": "And few of My servants are grateful. (Qur'an 34:13)"
    },
    {
      "translation": "Our Lord, accept this from us. Indeed You are the Hearing, the Knowing. (Qur'an 2:127)"
    }
  ],
  "Forgiveness": [
    {
      "translation": "My Lord, forgive and have mercy, for You are the best of the merciful. (Qur'an 23:118)"
    },
    {
      "translation": "Our Lord, forgive us our sins and remove from us our misdeeds. (Qur'an 3:193)"
    },
    {
      "translation": "O Allah, You are Most Forgiving, and You love forgiveness, so forgive me. (Hadith)"
    },
    {
      "translation": "And forgive us our sins, and grant us protection from our wrongdoings. (Qur'an 3:16)"
    },
    {
      "translation": "O my Lord, forgive me and my parents, and whoever enters my house as a believer. (Qur'an 71:28)"
    },
    {
      "translation": "Our Lord, do not impose blame upon us if we forget or make a mistake. (Qur'an 2:286)"
    },
    {
      "translation": "Our Lord, forgive us and our brothers who preceded us in faith, and put not in our hearts any resentment. (Qur'an 59:10)"
    },
    {
      "translation": "O Allah, distance me from my sins as You have distanced the East from the West. (Hadith)"
    },
    {
      "translation": "O Allah, wash away my sins with water, snow, and hail. (Hadith)"
    },
    {
      "translation": "And those who, when they commit an immorality or wrong themselves, remember Allah and seek forgiveness for their sins. (Qur'an 3:135)"
    }
  ],
  "Angry": [
    {
      "translation": "I seek refuge with Allah from Satan, the accursed. (Hadith)"
    },
    {
      "translation": "O Allah, forgive me, have mercy upon me, guide me, and grant me well-being. (Hadith)"
    },
    {
      "translation": "Those who restrain anger and pardon the people – and Allah loves the doers of good. (Qur'an 3:134)"
    },
    {
      "translation": "And if an evil suggestion comes to you from Satan, then seek refuge in Allah. (Qur'an 7:200)"
    },
    {
      "translation": "O Allah, fill my heart with peace and patience, and remove from me anger and resentment. (Inspired by Hadith)"
    },
    {
      "translation": "The strong person is not the one who can overpower others, but the strong one is he who controls himself when angry. (Hadith)"
    },
    {
      "translation": "Whoever suppresses anger while being able to act upon it, Allah will fill his heart with contentment. (Hadith)"
    },
    {
      "translation": "Indeed, Allah is with the patient. (Qur'an 2:153)"
    },
    {
      "translation": "And hasten to forgiveness from your Lord and a garden as wide as the heavens and the earth, prepared for the righteous. (Qur'an 3:133)"
    },
    {
      "translation": "O Allah, grant me patience and calmness in all matters. (Inspired by Hadith)"
    }
  ]
}
